[net]
width=28
height=28
channels=1
learning_rate=0.04

[convolutional]
filters=5
size=3
stride=1
activation=relu

[convolutional]
filters=5
size=3
stride=1
activation=relu

[convolutional]
filters=5
size=3
stride=1
activation=relu

[maxpooling]
size=2
stride=2

[convolutional]
filters=5
size=3
stride=2
activation=relu

[fclayer]
hiddens=100
outputs=10
activation_hidden=sigmoid
activation=sigmoid